Repository: Drexel2k/OpenEatsJournal
Catalog: src/lib/l10n/app_*.arb
Languages: de

# about_this_app
source: About this Open Eats Journal
de: Über Open Eats Journal

source: Tell about yourself
de: Erzähle von Dir

# your_targets
source: You targets
de: Deine Ziele

source: Eats Journal
de: Essenstagebuch

source: Welcome!
de: Willkommen!

# support_this_app
source: Support this Open Eats Journal
de: Unterstütze Open Eats Journal

# welcome_message_welcome
source: Welccome to Open Eats Journal, a free, data minimized and privacy friendly open source eats journal to track your food intake and nutritions.
de: Willkommen bei Open Eats Journal, eine freies, Open Source, datensparsarmes und datenschutzfreundliches Ernährungstagebuch um Deine Nahrungsaufnahme und Nährwerte nachzuverfolgen.

# welcome_message_data
source: Open Eats Journal needs to know some data from you to calculate nutrition target value proposals. Please notice, that this is no medical advice and that the app was not made by a medic or nutrition expert. In any doubt consult a nutrition expert or a doctor.
de: Open Eats Journal braucht ein paar Daten von Dir um Zielwertvorschläge für Deine Nährwerte zu berechnen. Bitte beachte, dass das kein medizinischer Rat ist und dass die App nicht von einem Mediziner oder Ernährungsexperten erstellt wurde. Bei Zweifeln konsultiere einen Ernährungsexperten oder Arzt.

# welcome_message_data_storage
source: All data is only stored on your device is not shared with anyone, only on querying online services to search for food and nutrition data the data required for the search is transfered.
de: Alle Daten werden nur auf Deinem Gerät gespeichert und mit niemandem geteilt, nur bei der Abfrage von Online Diensten zur Suche von Lebensmitteln und Nährwertdaten werden die für die Suche benötigten Daten übertragen.

# welcome_message_local_database
source: The local standard food database was made by best effort, as online food data source Open Food Facts is used.
de: Die lokale Standard Lebensmitteldatenbank wurde nach bestem Wissen und Gewissen erstellt, als Online Lebensmitteldatenquelle wird Open Food Facts genutzt.

# welcome_message_stay_healthy
source: Stay healthy!
de: Bleib gesund!

# welcome_message_license_1
source: Open Eats Journal comes with no warranties and is licensed under
de: Open Eats Journal kommt mit keinerlei Garantien und ist unter

# welcome_message_license_2
source: . You can find explanations on how your data is handled in the
de: lizenziert. In der

# welcome_message_contribute_1
source: If you want to contribute to Open Eats Journal or report issues, you can do this on
de: Wenn Du zu Open Eats Journal beitragen oder Probleme melden möchtest, kannst Du das auf

# welcome_message_donation_1
source: Please support Open Eats Journal with a donation on
de: Bitte unsterstütze Open Eats Journal mit einer Spende auf

# welcome_message_donation_voluntary
source: Donations are purely voluntary to support further development. There will be no premium features or paywalls. Every Euro helps to keep Open Eats Journal free from advertising, repeated harassments and other dark patterns or other nice "features"... Thank you!
de: Spenden sind rein freiwillig zur Unterstützung der Weiterenwticklung. Es wird keine Premium Features oder Paywalls geben. Jeder Euro hilft Open Eats Journal frei von Werbung, Gängelung, sonstigen Dark Patternn oder anderen netten "Features" zu halten... Danke!

source: AGPLv3 license
de: AGPLv3 Lizenz

source: privacy statement
de: Datenschutzerklärung

# privacy_statement_capital
source: Privacy statement
de: Datenschutzerklärung

source: Agree & Proceed
de: Zustimmen & Fortfahren

source: Proceed
de: Fortfahren

source: Finish
de: Fertigstellen

# license_agree
source: I agree to the license and to the data privacy policy.
de: Ich stimme der Lizenz und der Datenschutzerklärung zu.

# license_must_agree
source: You must agree to the license and privacy policy.
de: Du musst der Lizenz und der Datenschutzerklärung zustimmen.

source: Close
de: Schließen

# understood
source: I understood.
de: Ich habe verstanden.

# must_understood
source: You must confirm to understand the hints.
de: Du musst bestötigen, die Hinweise verstanden zu haben.

source: Your gender:
de: Dein Geschlecht:

source: male
de: Männlich

source: female
de: Weiblich

source: Your birthday:
de: Dein Geburtstag:

source: Your height
de: Deine Größe

source: Your weight
de: Dein Gewicht

source: Your units
de: Deine Einheiten

source: Birthday
de: Geburtstag

source: Height
de: Größe

source: weight
de: Gewicht

# weight_capital
source: Weight
de: Gewicht

# your_acitivty_level
source: Your activity level:
de: Dein Aktivitätslevel:

# acitivity_level_explanation
source: Very low: Sitting, no activity Low: Sitting, light sports (1-2 times / week) Medium: Predominantly sitting, some walking, moderate sports (2-3 times / week) High: Predominantly standing/walking, demanding sports (3-5 times / week) Very high: Physical demanding, demanding sports (6-7 times / week)
de: Sehr niedrig: Sitzen, keine Aktivität Niedrig: Sitzen, wenig Sport (1-2 Mal / Woche) Medium: Überwiegend sitzen, etwas laufen, moderater Sport (2-3 Mal / Woche) Hoch: Überwiegend stehen/laufen, fordernder Sport (3-5 Mal / Woche) Sehr hoch: Körperlich fordernd, fordernder Sport (6-7 Mal / Woche)

source: Very low
de: Sehr niedrig

source: Low
de: Niedrig

source: Medium
de: Mittel

source: High
de: Hoch

source: Very High
de: Sehr hoch

source: Professional Athlete
de: Prof. Sportler

# select_gender
source: Please select your gender.
de: Bitte wähle Dein Geschlecht.

# select_birthday
source: Please select your birth day.
de: Bitte wähle Deinen Geburtstag.

# valid_height
source: Please enter a valid height
de: Bitte gib eine gültige Größe ein (1-999).

# valid_weight
source: Please enter a valid weight
de: Bitte gib ein gültiges Gewicht ein (1-999).

# select_activity_level
source: Please select your activity level.
de: Bitte wähle Dein Aktivitätslevel.

source: Your weight target:
de: Dein Gewicht Ziel:

source: Keep weight
de: Gewicht halten

# lose025
source: -0,25kg per week
de: -0,25kg pro Woche

# lose05
source: -0,5kg per week
de: -0,5kg pro Woche

# lose075
source: -0,75kg per week
de: -0,75kg pro Woche

# proposed_values
source: Calories need is based on the Mifflin-St. Jeor formula and the Physical Activity Level Factor of the Food and Agriculture Organization of the United Nations. The target is calculated based on the assumption that 1 kg of body fat has approximately 7,000 kcal. These values can be adjusted in the settings (target values also per weekday).
de: Der Kalorienbedarf basiert auf der Mifflin-St. Jeor-Formel und dem Phyischen Aktivitätslevel Faktor der Food and Agriculture Organization of the United Nations. Das Ziel wird unter der Annahme berechnet, dass 1 KG Körperfett ca. 7.000 kCal hat. In den Einstellungen können diese Werte noch angepasst werden (Zielwerte auch pro Wochentag).

# in_doubt_consult_doctor
source: Individual values may differ, losing weight too fast is unhealthy and may be dangerous. In doubt consult a nutrition expert or doctor.
de: Individuelle Werte können abweichen, zu schnell Gewicht zu verlieren ist ungesund und kann gefährlich sein. Im Zweifel konsultiere einen Ernährungsexperten oder Arzt.

# select_target
source: Please select a target.
de: Bitte wähle ein Ziel.

source: Daily calories need
de: Täglicher Kalorienbedarf

source: Daily calories target
de: Tägliches Kalorienziel

source: Daily need
de: Tägl. Bedarf

source: Daily target (⌀)
de: Tägl. Ziel (⌀)

source: Statistics
de: Statistiken

source: fat
de: Fett

# fat_capital
source: Fat
de: Fett

source: {amount} fat
de: {amount} Fett

source: {amount} saturated fat
de: {amount} gesättigte Fettsäuren

source: carbs
de: KH

source: carbohydrates
de: Kohlenhydrate

# carbohydrates_capital
source: Carbohydrates
de: Kohlenhydrate

source: {amount} carb
de: {amount} KH

source: {amount} sugar
de: {amount} Zucker

source: {amount} salt
de: {amount} Salz

source: days
de: Tage

source: weeks
de: Wochen

source: months
de: Monate

# last_amount_timeinfo
source: Last {ammount} {timeInfo}
de: Letzte {ammount} {timeInfo}

# average_per_day_number
source: day ⌀: {average}
de: Tag ⌀: {average}

source: Settings
de: Einstellungen

source: Personal
de: Persönlich

source: Donate:
de: Spenden:

source: Contribute:
de: Beitragen:

# contribute_tooltip
source: Here you can contribute to Open Eats Journal or report issues.
de: Hier kannst Du zu Open Eats Journal beitragen oder Probleme melden.

source: About
de: Über

source: Language:
de: Sprache:

source: English
de: Englisch

source: German
de: Deutsch

# recalculate_calories_target
source: Recalc. Calories Targets
de: Kal. Ziele neu berechnen

# recalculate_calories_target_hint
source: Recalculating calories targets will overwrite all currently set daily calories target values.
de: Das Neuberechnen der Kalorien Ziele überschreibt alle täglichen Kalorien Zielwerte.

source: Are you sure?
de: Bist Du sicher?

source: Cancel
de: Abbrechen

# edit_calories_target
source: Edit Calories Targets
de: Kalorien Ziele bearbeiten

# new_word
source: new
de: neu

source: Monday
de: Montag

source: Tuesday
de: Dienstag

source: Wednesday
de: Mittwoch

source: Thursday
de: Donnerstag

source: Friday
de: Freitag

source: Saturday
de: Samstag

source: Sunday
de: Sonntag

source: Food management
de: Lebensmittelverwaltung

source: Food
de: Lebensmittel

# open_food_facts_exception
source: Open Food Facts connection error: {errorMessage}.
de: Open Food Facts Verbindungsfehler: {errorMessage}.

# open_food_facts_unexpected_response
source: Unexpected Open Food Facts response.
de: Unerwartete Open Food Facts Antwort.

# open_food_facts_unexpected_status
source: Unexpected Open Food Facts status code.
de: Unerwarteter Open Food Facts Status Code.

# search_unexpected_error
source: Unexpected error in search.
de: Unerwarteter Fehler in der Suche.

# enter_search_criteria
source: Please enter a search criteria.
de: Bitte ein Suchkriterium eingeben.

source: Search food...
de: Suche Lebensmittel...

source: popularity
de: Popularität

source: -no name-
de: -kein Name-

source: brands
de: Marken

source: -no brand-
de: -keine Marke-

source: per
de: pro

# too_many_results_for_sorting
source: Too many results for individual sorting (>500).
de: Zu viele Ergebnisse für individuelle Sortierung (>500).

# unknow_sorting_message
source: Unknown sorting hint.
de: Unbekannter Sortierhinweis.

source: breakfast
de: Frühstück

source: lunch
de: Mittagessen

source: dinner
de: Abendessen

source: Serving
de: Portion

source: Piece
de: Stück

source: Create food
de: Lebensmittel erstellen

source: Edit food
de: Lebensmittel bearbeiten

source: saturated fat
de: Gesätigte Fettsäuren

# saturated_fat_capital
source: Saturated fat
de: Gesätigte Fettsäuren

source: sugar
de: Zucker:

# sugar_capital
source: Sugar
de: Zucker

source: salt
de: Salz

source: Add eats journal entry
de: Ernährungseintrag hinzufügen

source: Edit eats journal entry
de: Ernährungseintrag bearbeiten

# enter_valid_amount
source: Please enter a valid amount.
de: Bitte eine gültige Menge eingeben

# enter_valid_eats_amount
source: Please enter a valid eats amount.
de: Bitte eine gültige Essensmenge eingeben

# input_invalid
source: {name} input invalid.
de: {name} Eingabe ist ungültig.

# input_invalid_value
source: {name} input invalid, current value is still {value}.
de: {name} Eingabe ist ungültig, der aktuelle Wert ist immer noch {value}.

source: As New Food
de: Als neues Lebensmittel

source: Eats Journal Entry
de: Essenseintrag

source: Weight Journal Entry
de: Gewichtseintrag

source: Quick Entry
de: Schnelleintrag

source: Amount for nutrition values
de: Mengen der Nährwerte

source: gram:
de: Gramm:

source: Nutrition values:
de: Nährwerte:

# default_key
source: Default
de: Standard

source: Delete
de: Löschen

source: Unit
de: Einheit

source: and
de: und

# gram_milliliter
source: Gram and milliliter
de: Gramm und Milliliter

source: nothing
de: nichts

source: Create
de: Erstellen

source: Amount
de: Menge

source: Food units
de: Einheiten

# food_units_invalid
source: At least one food unit entry contains a unit (g or ml) which is not set in amounts, food can't be saved.
de: Mindestens ein Einheitseintrag enthällt eine Einheit (g oder ml), die in den Mengen nicht gesetzt ist, das Lebenssmittel kann nicht gespeichert werden.

# amount_abbreviated
source: Amt.
de: Mng.

# delete_abbreviated
source: Del.
de: Lsch.

# unit_abbreviated
source: Unit
de: Einh.

source: empty
de: leer

source: Food created.
de: Lebensmittel erstellt.

source: Food updated.
de: Lebensmittel aktualisiert.

# cant_create_food
source: Can't create food, please correct errors.
de: Kann Lebensmittel nicht erstellen, bitte korrigiere die Fehler.

source: Edit
de: Bearbeiten

source: Update
de: Aktualisieren

# update_abbreviated
source: Update
de: Akt.

# settings_weight_explanation
source: Weight of the last weight journal entry. The weight entered is not saved here, but is only used for the kCal calculation.
de: Gewicht des letzten Gewichttagebucheintrags. Das eingegebene Gewicht wird hier nicht gespeicher sonder nur für die kCal Kalkulation genutzt.

source: Weight Journal
de: Gewichtstagebuch

# delete_weight_journal_entry
source: Delete Weight Entry
de: Gewichtseintrag löschen

# cant_delete_last_weight_journal_entry
source: Deletion of last weight entry not possible.
de: Löschen des letzten Gewichtseintrags nicht möglich.

# add_weight_journal_entry
source: Add Weight Entry
de: Gewichtseintrag hinzufügen

source: Energy
de: Energie

source: Whole day
de: Ganzer Tag

# breakfast_capital
source: Breakfast
de: Frühstück

# lunch_capital
source: Lunch
de: Mittagessen

# dinner_capital
source: Dinner
de: Abendessen

# cant_create_quick_entry
source: Can't create quick entry, please correct errors.
de: Kann Schnelleintrag nicht erstellen, bitte korrigiere die Fehler.

source: Quick entry added.
de: Schnelleintrag hinzugefügt.

source: Quick entry updated.
de: Schnelleintrag aktualisiert.

source: Add
de: Hzf.

source: Add quick entry
de: Schnelleintrag hinzufügen

source: Edit quick entry
de: Schnelleintrag bearbeiten

source: Basics
de: Basisinformationen

source: Recent
de: Zuletzt

source: As new eats journal entry
de: Als neuer Essenstagebucheintrag

# database_import_hint
source: All your exisiting data is overwritten during import. The database is in SQLite format and can be opened with DB Browser for SQLite (DB4S) e.g.
de: Die Datenbank wird nach \Android\data\com.drexeldevelopment.openeatsjournal\files\export exportiert und wird von \Android\data\com.drexeldevelopment.openeatsjournal\files\import\oej.db importiert. Alle Deine existierenden Daten werden während des Imports überschrieben. Die Datenbank ist im SQLite Format und kan z.B. mit DB Browser for SQLite (DB4S) geöffnet werden.

source: Export data
de: Daten exportieren

source: Import data
de: Daten importieren

source: File not found
de: Datei nicht gefunden

# no_file_to_import
source: No file to import found.
de: Keine Datei zum importieren gefunden.

source: Import succeeded
de: Import erfolgreich

# database_imported
source: Database was imported. App closes now.
de: Die Datenbank wurde importiert. Die App schließt sich jetzt.

source: Export succeeded
de: Export erfolgreich

# database_exported
source: Database was exported.
de: Die Datenbank wurde exportiert.

# export_not_succeeded
source: Export not successful
de: Export nicht erfolgreich

# database_not_exported
source: Database could not be exported.
de: Die Datenbank konnte nicht exportiert werden.

# wait_search
source: Please wait until the previous search completed before starting a new search.
de: Bitte warte bis die vorherige Suche beendet ist, bevor Du eine neues Suche startest.

# no_result_from_online_source
source: No result from online source. Please help and add the missing data. Tap for information on how to contribute.
de: Kein Ergebnis in der Online Suche. Bitte hilf mit und füge fehlende Daten hinzu. Tippe für Informationen, wie Du beitragen kannst.

source: No online result found?
de: Keine Online Ergebnisse gefunden?

# adding_online_data_1
source: Open Eats journal uses
de: Open Eats journal nutzt

# adding_online_data_2
source: as online source for food data. As this is open data you can help and improve their data. Especially barcode food should be available in Open Food Facts, if it is not found in Open Eats Journal, it may be missing at all or some data which is required by Open Eats Journal is missing. You can edit foods or add foods either on their website or with their app. Fore more information visit their website. This data is at least required by Open Eats Journal: Basic details/product characteristics: product name, quantity (e.g. 750g or 3x250g) Nutrition facts: energy, serving size (e.g. 50g).
de: als Online-Quelle für Lebensmitteldaten. Da dies Open Data ist, kannst Du helfen ihre Daten zu verbessern. Insbesondere Barcode Lebensmittel sollten in Open Food Facts verfügbar sein, wenn diese nicht in Open Eats Journal gefunden werden, fehlen diese ganz oder einige Daten, die Open Eats Journal benötigt, fehlen. Du kannst über ihre Website oder App Lebensmittel editieren oder hinzufügen. Für weitere Informationen besuche ihre Website. Diese Daten werden mindestens von Open Eats Journal benötigt: Allgemeine Informationen/Produkteigenschaften: Produktname, Menge (z.B. 750g oder 3x250g) Nährwertangaben: Energie, Portionsgröße (z.B. 50g).

# could_not_parse_open_food_facts_answer
source: Open Food Facts Antwort konnte nicht gelesen werden.
de: Could not parse Open Food Facts answer.

# weight_impact
source: Your current weight may have impact on your calories need and targets, consider recalculating these values in the settings.
de: Dein aktuelles Gewicht kann Einfluss auf Deinen Kalorienbedarf und Deine Kalorienziele haben, berechne diese Werte evtl. in den Einstellungen neu.

source: Energy unit
de: Energieeinheit

source: Height unit
de: Höheneinheit

source: Weight unit
de: Gewichtseinheit

source: Volume unit
de: Volumeneinheit

source: inch
de: Zoll

source: ounce
de: Unze

source: fluid ounce (GB)
de: Flüssigunze (GB)

source: fluid ounce (US)
de: Flüssigunze (US)

# no_data
source: No Data Available
de: Keine Daten vorhanden
